[
  "table-editor-obsidian",
  "copy-publish-url",
  "cmdr",
  "reveal-active-file-button",
  "templater-obsidian",
  "tag-wrangler",
  "vault-name-status-bar",
  "broken-links",
  "obsidian-auto-link-title",
  "obsidian-plugin-update-tracker"
]