[
  "obsidian-tasks-plugin",
  "dataview",
  "obsidian-style-settings",
  "cmdr",
  "vault-name-status-bar",
  "templater-obsidian",
  "helpmate",
  "quickadd",
  "obsidian42-brat",
  "hot-reload",
  "obsidian-theme-design-utilities",
  "number-headings-obsidian",
  "broken-links",
  "obsidian-plugin-update-tracker"
]