[
  "obsidian-tasks-plugin",
  "dataview",
  "obsidian-style-settings",
  "cmdr",
  "vault-name-status-bar",
  "templater-obsidian",
  "helpmate",
  "quickadd",
  "obsidian42-brat",
  "hot-reload",
  "obsidian-theme-design-utilities",
  "number-headings-obsidian",
  "broken-links",
  "obsidian-plugin-update-tracker",
  "obsidian-kanban",
  "js-engine",
  "table-editor-obsidian",
  "reveal-active-file-button",
  "obsidian-meta-bind-plugin",
  "vault-nickname",
  "open-plugin-settings",
  "calendar",
  "nldates-obsidian",
  "various-complements"
]