{
  "main": {
    "loadingPlugin": "Loading plugin: {{name}} v{{version}}",
    "unloadingPlugin": "Unloading plugin: {{name}} v{{version}}"
  },
  "settings": {
    "changeRequiresRestart": "Changing any settings requires a restart of obsidian.",
    "dates": {
      "cancelledDate": {
        "description": "Enabling this will add a timestamp ❌ YYYY-MM-DD at the end when a task is toggled to cancelled.",
        "name": "Set cancelled date on every cancelled task"
      },
      "createdDate": {
        "description": "Enabling this will add a timestamp ➕ YYYY-MM-DD before other date values, when a task is created with 'Create or edit task', or by completing a recurring task.",
        "name": "Set created date on every added task"
      },
      "doneDate": {
        "description": "Enabling this will add a timestamp ✅ YYYY-MM-DD at the end when a task is toggled to done.",
        "name": "Set done date on every completed task"
      },
      "heading": "Dates"
    },
    "datesFromFileNames": {
      "heading": "Dates from file names",
      "scheduledDate": {
        "description": {
          "line1": "Save time entering Scheduled (⏳) dates.",
          "line2": "If this option is enabled, any undated tasks will be given a default Scheduled date extracted from their file name.",
          "line3": "By default, Tasks plugin will match both <code>YYYY-MM-DD</code> and <code>YYYYMMDD</code> date formats.",
          "line4": "Undated tasks have none of Due (📅 ), Scheduled (⏳) and Start (🛫) dates."
        },
        "name": "Use filename as Scheduled date for undated tasks"
      }
    },
    "format": {
      "description": {
        "line1": "The format that Tasks uses to read and write tasks.",
        "line2": "<b>Important:</b> Tasks currently only supports one format at a time. Selecting Dataview will currently <b>stop Tasks reading its own emoji signifiers</b>."
      },
      "displayName": {
        "dataview": "Dataview",
        "tasksEmojiFormat": "Tasks Emoji Format"
      },
      "name": "Task Format"
    },
    "globalFilter": {
      "filter": {
        "description": {
          "line1": "Recommended: Leave empty if you want all checklist items in your vault to be tasks managed by this plugin.",
          "line2": "Use a global filter if you want Tasks to only act on a subset of your \"<code>- [ ]</code>\" checklist items, so that a checklist item must include the specified string in its description in order to be considered a task.",
          "line3": "For example, if you set the global filter to <code>#task</code>, the Tasks plugin will only handle checklist items tagged with <code>#task</code>.",
          "line4": "Other checklist items will remain normal checklist items and not appear in queries or get a done date set."
        },
        "name": "Global filter",
        "placeholder": "e.g. #task or TODO"
      },
      "heading": "Global task filter",
      "removeFilter": {
        "description": "Enabling this removes the string that you set as global filter from the task description when displaying a task.",
        "name": "Remove global filter from description"
      }
    },
    "globalQuery": {
      "heading": "Global Query",
      "query": {
        "description": "A query that is automatically included at the start of every Tasks block in the vault. Useful for adding default filters, or layout options.",
        "placeholder": "For example...\npath does not include _templates/\nlimit 300\nshow urgency"
      }
    },
    "seeTheDocumentation": "See the documentation",
    "statuses": {
      "heading": "Task Statuses"
    }
  }
}
